app/Controllers/Admin.php

SELECT *
FROM `repartidor`
WHERE `repartidor`.`deleted_at` IS NULL
---
public function mostrarRepartidores()
{
    $session = session();
    // Verifica si el usuario ha iniciado sesión
    if($session->get('logged_in')==TRUE){
        // Obtiene todos los repartidores
        $repartidoresModel = model('RepModel');
        $data ['repartidores'] = $repartidoresModel->findAll();

SELECT *
FROM `paquete`
WHERE `paquete`.`deleted_at` IS NULL
SELECT *
FROM `comparativa`
WHERE `comparativa`.`deleted_at` IS NULL
---
public function mostrarPaquetes()
{
    $session = session();
    // Verifica si el usuario ha iniciado sesión
    if($session->get('logged_in')==TRUE){
        // Obtiene todos los paquetes y comparativas
        $paquetesModel = model('PaquetesModel');
        $data1['paquetes'] = $paquetesModel->findAll();
        $comparativaModel = model('ComparativaModel');
        $data1['comparativas'] = $comparativaModel->findAll();

SELECT *
FROM `salidas`
WHERE `salidas`.`deleted_at` IS NULL
---
public function mostrarSalidas()
{
    $session = session();
    // Verifica si el usuario ha iniciado sesión
    if($session->get('logged_in')==TRUE){
        // Obtiene todas las rutas
        $salidaModel = model('SalidaModel');
        $data4['rutas'] = $salidaModel->findAll();

SELECT *
FROM `repartidor`
WHERE `repartidor`.`deleted_at` IS NULL
---
public function salidas()
{
    $session = session();
    // Verifica si el usuario ha iniciado sesión
    if($session->get('logged_in')==TRUE){
        // Obtiene todas las salidas y repartidores
        $db = db_connect();
        $sql = "SELECT ruta.*, infoPaquetes.*
        FROM ruta, infoPaquetes
        where ruta.idRuta = infoPaquetes.idRuta";
        $query = $db->query($sql);
        $data4['salidas'] = $query->getResult();
        $repartidoresModel = model('RepModel');
        $data4['salidas'] = $repartidoresModel->findAll();

SELECT *
FROM `repartidor`
WHERE `repartidor`.`deleted_at` IS NULL
---
public function mostrarRV()
{
    $repartidoresModel = model('RepModel');
    $data ['repartidores'] = $repartidoresModel->findAll();